Repository: JimHadar1995/WebSshPrSample
Catalog: Source/WebSsh.ResourceManager/Validation/ValidationConstants.*.resx
Languages: ru

source: Admin {0} was blocked due to exceeding the number of password attempts by {1} min.
ru: Администратор {0} заблокирован из-за превышения количества попыток ввода пароля на {1} мин.

source: Cannot tie admin to LDAP user
ru: Невозможно привязать локального пользователя к учетной записи LDAP

source: Changing the preset role is prohibited
ru: Изменение предустановленной роли запрещено

source: Changing the preset user is prohibited
ru: Изменение предустановленного пользователя запрещено

source: Field 'New password' and field 'Confirm password' must be equals
ru: Значения полей "Новый пароль" и "Подтверждение пароля" должны совпадать

source: Field 'Password' value length must be contains minimum {0} and maximum {1} symbols
ru: Поле 'Пароль' должно содержать не менее {0} и не более {1} символов

source: Field '{PropertyName}' can contains only latin alphabets, numbers and spec symbols: -, _
ru: Поле '{PropertyName}' может содержать только латинские буквы, цифры и спец символы -, _

source: Field '{PropertyName}' is required
ru: Поле '{PropertyName}' обязательно

source: Field '{PropertyName}' must be contains digits
ru: Поле '{PropertyName}' должно содержать цифры

source: Field '{PropertyName}' must be contains not alfa symbols, not numeric symbols
ru: Поле '{PropertyName}' должно содержать нечисловые и нецифровые символы

source: Field '{PropertyName}' must be contains symbols in lower case
ru: Поле '{PropertyName}' должно содержать символы в нижнем регистре

source: Field '{PropertyName}' must be contains symbols in upper case
ru: Поле '{PropertyName}' должно содержать символы в верхнем регистре

source: Field '{PropertyName}' must be unique
ru: Поле '{PropertyName}' должно быть уникальным

source: Field '{PropertyName}' value must be less or equal
ru: Значение поля '{PropertyName}' должно быть меньше или равно

source: Field length '{PropertyName}' cannot greater 250 symbols
ru: Длина поля '{PropertyName}' не должна превышать 250 символов

source: Field length '{PropertyName}' cannot greater 50 symbols
ru: Длина поля '{PropertyName}' не должна превышать 50 символов

source: Field value '{PropertyName}' must be greater 0
ru: Значение поля '{PropertyName}' должно бьть больше 0

source: Field value '{PropertyName}' must be greater or equal
ru: Значение поля '{PropertyName}' должно быть больше или равно

source: Incorrect password entered
ru: Текущий пароль введен неверно

source: Invalid login or password
ru: Неверный логин или пароль

source: LDAP domain connection settings are incorrect
ru: Настройки подключения к домену LDAP заданы некорректно

source: LDAP user not found
ru: Пользователь LDAP не найден

source: No privileges specified for the role
ru: Для роли не указано ни одной привилегии

source: Old and new passwords must not match
ru: Новый пароль и текущий не должны совпадать

source: Preset administrator lock disabled
ru: Блокировка предустановленного администратора запрещена

source: Removing the preset role is prohibited
ru: Удаление предустановленнй роли запрещено

source: Removing the preset user is prohibited
ru: Удаление предустановленного пользователя запрещено

source: Roles not exists
ru: Указанные роли не найдены

source: Service user not found
ru: Не найден сервисный пользователь

source: The minimum number of characters changed in the password must be {0}
ru: Минимальное количество измененных символов в пароле должно быть {0}

source: The new password has already been used before. Please enter a different password
ru: Новый пароль уже был использован ранее. Пожалуйста введите другой пароль

source: The password contains one of the popular passwords.
ru: Пароль содержит один из популярных паролей.

source: The value of the field 'Minimum number of changed password characters on edit' cannot be greater than or equal to the value of the field 'Minimum password length'
ru: Значение поля 'Минимальное количество измененных символов при редактировании пароля' не может быть больше или равно значения поля 'Минимальная длина пароля'

source: The value of the field 'Minimum password age' shall not exceed the value of the field 'Maximum password age'
ru: Значение поля 'Минимальное время действия пароля' не должно превышать значение поля 'Максимальное время действия пароля'

source: To continue working with the system, you must change the password
ru: Для продолжения работы с системой необходимо сменить пароль

source: User group not found
ru: Группа пользователей не найдена

source: User locked
ru: Пользователь заблокирован

source: User with ID = {0} not found
ru: Пользователь с ID = {0} не найден
